Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: All games that you make in GameMaker Studio 2 need at least one room to run (but can have many, many more) , and a room is just a space where you place instances of the objects that make up your game as well as tiles and any other graphical resources.
zh_cn: 所有在 GameMaker Studio 2 中制作的游戏至少拥有一个房间（但可以有更多），而房间只是一个空间，您可以在其中放置构成游戏的物体的实例以及图块和任何其他图形资源。

source: All objects have a set of properties which you can specify in the object editor, like the sprite, whether it uses physics or not, or whether it is a "child" object of another one.
zh_cn: 所有物体都有一组可在对象编辑器中被设置的属性，例如链接精灵，是否使用物理规则，或者设置为其他对象的子对象。

source: All real numbers are stored as 32bit floating point values (even integer values), so you may experience slight rounding errors when dealing with these.
zh_cn: 所有的实数都被存储为一个32位的浮点数（即使是个整数），因此在处理这些数据的时候你可能会遇到一些轻微的舍入误差（Rounding Errors）。

source: All sprites (and all other resources) must have a name given to them so that you (and GameMaker Studio 2) can identify them easily, although you should note that this name is really just a variable which holds an ID value that "points" to the resource, in this case a sprite.
zh_cn: 所有的精灵（以及其他资源）必须有一个自己的名字，以便你（和 GameMaker Studio 2）可以很容易地识别它们，但是你应该注意到这个名字实际上只是一个变量，它保存着一个 ID 值“点对点” 连接到资源，在目前情况下是连接到一个精灵。

source: All target platforms
zh_cn: 全平台

source: All target platforms except Windows 8 (JS)
zh_cn: 除Windows 8 (JS)以外的所有目标平台

source: All targets come with two compile options, one is the VM that uses a runner and interpreted code and the other which is the YYC (YoYo Compiler) which creates native code and a compiled executable.
zh_cn: 所有目标平台都有两个编译选项：一个是VM，它使用一个运行器来解释代码；另一个是YYC，是创建本机代码并编译可执行程序。

source: All the bits in this case have moved to the left by one, making it move from the 3rd bit, to the 4th, and changing the value from 4 to 8.
zh_cn: 这里所有的位都向左移动了 1 位，使它从 3 位变成 4 位，值从 4 变成 8。

source: All the characters, monsters, balls, walls, etc... are all objects you create in the resource tree.
zh_cn: 所有的角色，怪物，球，墙壁等都是您在资源树中创建的物体。

source: All this makes the whole collision code monumentally faster, and lets you spend the CPU time where you really need it.
zh_cn: 所有这些都使得整个碰撞代码非常快，并且允许您在真正需要的地方花费 CPU 时间。

source: All this script does is check to see if an instance has the same object_index as a given object and would be called simply as:
zh_cn: 该脚本所做的事情无非就是检测实例是否具有和所给定object一致的object_index，并且可以简化调用为：

source: All values that are passed into a script are assigned the following built-in variables:
zh_cn: 所有值都被传入脚本，并且被赋给了如下的内置变量：

source: Allow Block Comments
zh_cn: 允许块注释

source: Allow Flipped Landscape Orientation
zh_cn: 允许设备横向翻转

source: Allow Flipped Portrait Orientation
zh_cn: 允许设备纵向翻转

source: Allow Fullscreen Switching
zh_cn: 允许全屏切换

source: Allow Incoming Network Connections
zh_cn: 允许网络连入

source: Allow Landscape Orientation
zh_cn: 允许设备横向

source: Allow Menu and Dock in Fullscreen
zh_cn: 允许菜单和停靠栏全屏化

source: Allow Outgoing Network Connections
zh_cn: 允许网络传出

source: Allow Portrait Orientation
zh_cn: 允许设备纵向

source: Allow Scaling
zh_cn: 允许缩放

source: Allow anonymous game statistics
zh_cn: 允许匿名游戏统计

source: Allow breakpoints
zh_cn: 允许断点

source: Allow column selection
zh_cn: 允许列向选择

source: Allow empty tabs to be closed via the keyboard shortcut
zh_cn: 允许通过键盘快捷键关闭空的选项卡

source: Allow flipped landscape orientation
zh_cn: 允许翻转横向方向

source: Allow flipped portrait orientation
zh_cn: 允许翻转纵向方向

source: Allow fullscreen switching
zh_cn: 允许全屏切换

source: Allow incoming network connections
zh_cn: 允许网络连入

source: Allow label font to scale above 100%
zh_cn: 允许标签字体缩放 100%以上

source: Allow label font to scale below 100%
zh_cn: 允许标签字体在100%以下缩放

source: Allow landscape orientation
zh_cn: 允许横向

source: Allow menu and dock in fullscreen
zh_cn: 全屏时允许菜单和停靠栏

source: Allow outgoing network connections
zh_cn: 允许网络传出

source: Allow player to resize window
zh_cn: 允许玩家调整窗口大小

source: Allow portrait orientation
zh_cn: 允许纵向

source: Allow window resize
zh_cn: 允许窗口调整大小

source: Allow workspace chains to overlap
zh_cn: 允许工作区连接线交叉

source: Allowed Webserver IPs
zh_cn: 允许的 Web服务器 IP

source: Allowed Webserver IPs/Hostnames/CIDR IP Ranges
zh_cn: 允许的 Web服务器 IP/主机名/CIDR IP 范围

source: Alpha
zh_cn: Alpha值

source: Alpha:
zh_cn: 透明度：

source: Alphanumeric
zh_cn: 字符

source: Already a resource with name '{0}' - please rename it before importing the extension
zh_cn: 已经存在资源名 '{0}' - 导入这个扩展之前请重命名它

source: Also note that if you deactivate a persistent object, it will no longer pass from one room to another unless re-activated before the Room End event is triggered.
zh_cn: 另请注意，如果您停用持久性对象，它将不会再从一个房间传递到另一个房间，除非在客户端事件触发之前重新启动。

source: Also note that while the image above shows a full wall tile set with 47 tiles, you may not need so many as you can rotate and flip tiles when placing them in the room editor later.
zh_cn: 还要注意的是，虽然上面的图片显示了一个镶满 47 块图块的完整墙面砖，但您可能不需要这么多，因为稍后将它们放置在房间编辑器中时，您可以旋转和翻转图块。

source: Also note that you can set the default Packaging Option from the UWP Preferences) so that GameMaker Studio 2 remembers the choice for all future compiles (meaning this options window will not be shown).
zh_cn: 另请注意，您可以在 UWP 首选项 中设置默认打包选项，以便 GameMaker Studio 2 记住所有编译器的选择（同时意味着此选项窗口将不会显示）。

source: Also, the break is not required, and if there is no break statement the execution simply continues with the code for the next case statement.
zh_cn: 同样，“break”也不是必须的，没有它时，简单的继续到下一个case语句。

source: Also, the following unary operators exist:
zh_cn: 还存在以下一元运算符：

source: Alternate synchronization method
zh_cn: 交替同步法

source: Always
zh_cn: 总是

source: Always do full install of APK
zh_cn: 始终安全安装 APK

source: Always immediately open newly created resources
zh_cn: 总是立即打开新创建的资源

source: Always open new resources created by dropping files into the IDE
zh_cn: 总是立即打开拖拽到IDE的资源

source: Amazon APIs
zh_cn: 亚马逊 APIs

source: Amazon Fire Devices
zh_cn: Amazon Fire 设备

source: Amazon Fire Settings Error
zh_cn: Amazon Fire 设置错误

source: An Error Occurred
zh_cn: 发生错误

source: An Intel Dual Core i3 processor
zh_cn: 一个 Intel 双核 i3 处理器

source: An Intel Quad Core i5 processor
zh_cn: 一个 Intel 四核 i5 处理器

source: An anchor or dimension has been set to percentage with no parent gadget
zh_cn: 已经设置了一个锚点或者尺寸，其值百分比于没有父的小工具。An anchor or dimension has been set to percentage with no parent gadget

source: An anchor or dimension has been set to percentage with no parent gadget, try using pixel instead
zh_cn: 锚点或者尺寸被设置为父部件的百分比，但是并没有设置父部件。将尝试用像素值代替。

source: An array is a special data type that can be used to hold multiple values.
zh_cn: 数组是一个特殊的数据类型，它们可以用来存储多个值。

source: An array or two can make it much easier to create a good menu system.
zh_cn: 如果有一两个数组的话，创造一个良好的菜单系统就不是什么难事了。

source: An assignment simply stores a value in a variable and has the form:
zh_cn: 赋值语句把一个值赋予一个变量，其格式如下：

source: An enum is an "enumerator", and it essentially permits you to create your own limited data type with a list of constant values.
zh_cn: 一个枚举也成为一个枚举器（Enumerator），它们允许你使用常量值列表创建自己的有限的数据类型。

source: An error has occurred in the game.
zh_cn: 游戏中发生一个错误。

source: An error occured:{0}
zh_cn: 发生错误：{0}

source: An error occurred
zh_cn: 出现一个错误

source: An error occurred while trying to download the manual
zh_cn: 尝试下载帮助文档时发生错误

source: An example of how your final command should look would be:
zh_cn: 最后的命令看起来应该是这样的：

source: An expression can be a simple value but can also be more complicated, so, rather than assigning a value to a variable, one can also add a value to the current value of the variable using +=, for example:
zh_cn: 其中，表达式（expression）可以是一个值，也可以是复杂的代数式，除了将一个值赋给一个变量，还可以使用 “+=”在变量存储的值上加一个值，比如：

source: An extension file with the same name already exists.
zh_cn: 同名扩展文件已经存在。

source: An image in the {0} file failed to load.
zh_cn: {0} 文件中的一个图像加载失败。

source: An image that is to be tiled will have the edges (horizontal or vertical)\nadded to by the edges from the opposite side.
zh_cn: 平铺的图像（水平或者垂直）边缘挨着另一侧边缘添加(?)。

source: An open project is required to import assets.\nDo you want to create a new project or open an existing project now?
zh_cn: 导入资产需要一个打开的项目。\n 现在你想创建一个新项目或者打开一个已存在的项目吗？

source: An overview will appear here when you add an action
zh_cn: 当你增加一个动作，这里将出现一个概述

source: An unsigned, 16bit integer.
zh_cn: 一个无符号的16位整数

source: An update is available for this asset.
zh_cn: 该资产有可用更新。

source: An updated runtime is available in {0}!
zh_cn: {0}中有可用的运行库更新！

source: Analytics
zh_cn: 分析

source: Anchor point colour
zh_cn: 锚点颜色

source: Anchor point height
zh_cn: 锚点高度

source: Anchor point width
zh_cn: 锚点宽度

source: And now in your Event Editor you'll see this:
zh_cn: 现在在您的活动编辑器中，您将看到：

source: And the actual finished animation would look like this when placed in a game:
zh_cn: 实际完成的动画放置在游戏中看起来是这样的：

source: And the script should now look like this:
zh_cn: 脚本这样写：

source: And you can find a full explanation of all the different parts of the Object Editor here:
zh_cn: 你可以在这里找到 物体编辑器 所有部分的完整解释：

source: Android Devices
zh_cn: Android 设备

source: Android Keystore
zh_cn: Android 密钥库

source: Android NDK Location
zh_cn: Android NDK 位置

source: Android NDK Not Valid
zh_cn: Android NDK 无效

source: Android NDK Not Validated
zh_cn: Android NDK 未经校验

source: Android NDK Valid
zh_cn: Android NDK 有效

source: Android NDK location
zh_cn: Android NDK 位置

source: Android Permissions:
zh_cn: Android 权限：

source: Android SDK Location
zh_cn: Android SDK 位置

source: Android SDK Not Valid
zh_cn: Android SDK 无效

source: Android SDK Not Valid - Invalid JDK
zh_cn: Android SDK 无效 - JDK 无效

source: Android SDK Not Valid - Missing Keystore
zh_cn: Android SDK 无效 - 丢失密钥库

source: Android SDK Not Validated
zh_cn: Android SDK 未经验证

source: Android SDK Valid
zh_cn: AndroidSDK 有效

source: Android SDK location
zh_cn: Android SDK 位置

source: Android Settings Error
zh_cn: Android 设置错误

source: Android Specific
zh_cn: Android 特定

source: Angle
zh_cn: 角度

source: Angular Damping
zh_cn: 角度阻尼

source: Animation
zh_cn: 动画

source: Animation End
zh_cn: 动画结束

source: Animation Event
zh_cn: 动画事件

source: Animation Speed
zh_cn: 动画速度

source: Animation Speed:
zh_cn: 动画速度：

source: Animation Speed: Frames Per Second
zh_cn: 动画速度：帧每秒（FPS）

source: Animation Update
zh_cn: 动画更新

source: Animations
zh_cn: 动画

source: Animations Library
zh_cn: 动画库

source: Another example of parenting would be if you have a game where you want to create 10 different looking objects and have them all behave in the same way.
zh_cn: 育儿的另一个例子是，如果你有一个游戏，你想要创建10个不同寻找的对象，并使它们都以相同的方式行事。

source: Another important feature of workspaces is that you can click on the tab and - still holding the mouse button down - drag it off of the main IDE window into its own individual window, making it very easy to organise things if you are using - for example - multiple displays.
zh_cn: 工作空间的另一个重要特点是您可以点击 标签，并且按住鼠标按钮 - 将其从主 IDE 窗口拖出到自己的电脑桌面中，使其便于组织， 例如您正在使用多个显示器。

source: Another important thing to do know is how to set the collision mask for the sprite.
zh_cn: 另一个重要的事情是知道如何设置精灵的 碰撞盒 。

source: Another method for navigating the workspace is to use Bookmarks.
zh_cn: 导航工作区的另一种使用方法是使用 书签。

source: Another thing you can do with surfaces is use them as textures to be manipulated, or to create sprites "on the fly", or to create complex overlays.
zh_cn: 另外就是使用表面作为需要操作的纹理贴图，或者创建“在飞”的精灵，或者创建复杂的叠加。

source: Anti-Aliasing Mode
zh_cn: 抗锯齿模式

source: Anti-alias
zh_cn: 抗锯齿

source: Anti-aliasing
zh_cn: 抗锯齿

source: Any
zh_cn: 任意键

source: Any Button
zh_cn: 任意鼠标键

source: Any other negative number means a synchronisation failure
zh_cn: 负数意味着同步失败。

source: Any type of collision mask other than rectangle will be slower to resolve, but when making a small, simple game it's not usually an issue.
zh_cn: 除矩形以外的其他类型的碰撞盒设置相对较慢，但是当制作一个小而简单的游戏时，这通常不是问题。

source: Anything under 0 is essentially infinite (limited by the memory available) while positive values will limit the stack to that number, removing any action at the tail of the stack if the limit is reached.
zh_cn: 0或者低于0表示不限（受可用内存限制），而正数将限制堆栈为指定的数值，如果达到限制将删除堆栈尾部的动作。

source: Apart from creating your own assets and code for your projects, you also have access to the GameMaker Studio 2 Marketplace where you can download both free and paid assets to be added to your projects.
zh_cn: 除了为你的项目创建你自己的资源和代码以外，你也可以通过 GameMaker Studio 2 的 市场（Marketplace）来下载免费的和付费的资源并将其添加到你的项目中。

source: Apart from the coloured bars, there are also a few values at the top.
zh_cn: 除了彩色的显示条，顶部还有几个值。

source: Apart from the options above there are also two sub-categories for the code and dialog editor preferences (shown together below as the preferences are exactly the same for both):
zh_cn: 除了上述选项之外，还有两个子类别用于代码和对话框编辑器偏好设置（在下面一起显示是因为他们的偏好设置完全相同）：

source: Apart from these compile errors, you can also get syntax errors.
zh_cn: 除了这些编译错误，您还可以获得语法错误。

source: Apart from these drop down menus, you also have a series of buttons along the top with which you can control certain aspects of your game and the Debug Modules interaction with it.
zh_cn: 除了这些下拉菜单，窗口上你还有一排按钮来控制你游戏中的方方面面，让游戏与调试模块产生互动。

source: App ID
zh_cn: 应用 ID

source: App Icon
zh_cn: 应用图标

source: App Id
zh_cn: 应用 Id

source: App Output
zh_cn: 应用输出

source: App Store
zh_cn: 应用商店

source: Append this to an if-statement to execute code when the condition evaluates to false.
zh_cn: 将此附加到if语句，在条件求值为false时执行此代码。

source: Application
zh_cn: 应用

source: Application Surface
zh_cn: 应用表面层

source: Applies To...
zh_cn: 应用到...

source: Apply
zh_cn: 应用

source: Apply To
zh_cn: 应用于

source: Apply To:
zh_cn: 应用于：

source: Apply a transformation to tile data.
zh_cn: 将变换应用于图块数据。

source: Apply friction to the instance's movement.
zh_cn: 对实例的移动应用阻力。

source: Apply to All Frames
zh_cn: 应用到所有帧

source: Apply to a different instance.
zh_cn: 应用于其他实例。

source: Applying Actions To Other Instances
zh_cn: 将动作应用于其他实例

source: Arc
zh_cn: 弧线

source: Arc tool
zh_cn: 弧线工具

source: Architecture
zh_cn: 架构

source: Archiving...
zh_cn: 归档...

# Are you sure you want to Replace All? This will edit files on disk.
source: Are you sure you want to Replace All?\nThis will edit files on disk.
zh_cn: 你确定要替换全部吗？\n这将编辑磁盘上的文件。

source: Are you sure you want to continue?
zh_cn: 你确定要继续吗？

source: Are you sure you want to cut the selected event?
zh_cn: 确定要剪切选中的事件吗？

source: Are you sure you want to delete all files in '{0}'?
zh_cn: 你确定要删除 '{0}' 里的所有文件吗？

source: Are you sure you want to delete configuration '{0}'?
zh_cn: 确定要删除配置 '{0}'？

source: Are you sure you want to delete local content for '{0}'?\nYou will need to be online to download it again.
zh_cn: 您确定要删除'{0}'的本地内容吗？\n您将需要在线再次下载。

source: Are you sure you want to delete the argument?
zh_cn: 您确定想要删除参数吗？

source: Are you sure you want to delete the file?
zh_cn: 你确定要删除这个文件吗？

source: Are you sure you want to delete the following items (Note: Instance creation code will be irrevocably lost): {0}
zh_cn: 您确定要删除以下项目吗（注意：实例创建代码将不可避免地丢失）：{0}

source: Are you sure you want to delete the following layers (Note: Instance creation code will be irrevocably lost): {0}
zh_cn: 你确定删除以下层吗（注：实例创建代码将不可避免地丢失）： {0}

source: Are you sure you want to delete the iOS 3rd party framework?
zh_cn: 你确定要删除 iOS 第三方框架吗？

source: Are you sure you want to delete the iOS system framework?
zh_cn: 你确定想要删除 iOS 系统框架吗？

source: Are you sure you want to delete the permission?
zh_cn: 你确定要想要删除权限吗？

source: Are you sure you want to delete the proxy?
zh_cn: 您确定要删除代理吗？

source: Are you sure you want to delete the resource?
zh_cn: 您确定想要删除资源吗？

source: Are you sure you want to delete these resources: {0}?
zh_cn: 你确定要删除这些资源吗： {0}？

source: Are you sure you want to delete these resources: {0}?\nCollision events with deleted objects will also be deleted
zh_cn: 您确定要删除这些资源 {0}吗？\n与所删除物体的碰撞事件也将一起被删除

source: Are you sure you want to delete these resources: {0}?\nIncluded files/folders on disk will be deleted
zh_cn: 你确定要删除这些资源： {0}？\n硬盘上的文件/文件夹也会被删除

source: Are you sure you want to delete this DnD™ action?
zh_cn: 确定要删除这个DnD™ 动作吗？

source: Are you sure you want to delete this layout?
zh_cn: 确定要删除这个布局吗？

source: Are you sure you want to delete {0}?
zh_cn: 你确定要删除{0}吗？

source: Are you sure you want to delete {0}?\nCollision events with deleted objects will also be deleted
zh_cn: 是否确定要删除 {0}？\n与所删除物体的碰撞事件也将一起被删除

source: Are you sure you want to delete {0}?\nIncluded files/folders on disk will be deleted
zh_cn: 你确定要删除{0}吗？\n在硬盘上的内含文件/文件夹也将一起被删除

source: Are you sure you want to exit?
zh_cn: 确定要退出吗？

source: Are you sure you want to install version {0}?
zh_cn: 确定安装版本 {0}？

source: Are you sure you want to remove the event with all its actions?
zh_cn: 确定要移除这个事件，包括它所有的动作吗？

source: Are you sure you want to remove {0} events with all their actions?
zh_cn: 确定要移除 {0} 事件，包括它所有的动作吗？

source: Are you sure you want to reset the layout?
zh_cn: 确定要重置布局吗？

source: Are you sure you want to restore default settings?\nThis will restart the application for the changes to take effect.
zh_cn: 你确认要恢复默认设置吗？\n这将重启软件，以使应用更改生效。

source: Are you sure you want to set '{0}' as the room inheritance parent of '{1}'?
zh_cn: 你确定想要设置 '{0}' 作为 '{1}'的房间继承关系的父项？

source: Are you sure you want to set this to streaming?
zh_cn: 您确定要将其设置为流式传输吗？

source: Are you sure you want to turn statistics off?\n\nAnonymous statistics allow us to provide developers with info about their target audience and focus development in key areas
zh_cn: 您确定要关闭统计信息吗？\n\n匿名统计信息允许我们向开发人员提供有关其目标受众的信息，并重点关注关键领域的开发

source: Are you sure you want to turn this off?
zh_cn: 是否确实要关闭此功能？

source: Are you sure you wish to delete this remote?
zh_cn: 你确定想要删除这个远程库吗（remote）？

source: Are you sure?
zh_cn: 您确定吗？

source: Area select highlight colour
zh_cn: 区域选择高亮颜色

source: Area: {0},{1} {2},{3}
zh_cn: 范围：{0},{1} {2},{3}

source: Argument
zh_cn: 参数

source: Argument 0
zh_cn: 参数 0

source: Argument 1
zh_cn: 参数 1

source: Argument 2
zh_cn: 参数 2

source: Argument 3
zh_cn: 参数 3

source: Argument Errors
zh_cn: 参数错误

source: Argument Gadget
zh_cn: 参数部件

source: Argument Layout
zh_cn: 参数布局

source: Argument Properties
zh_cn: 参数属性

source: Arguments
zh_cn: 参数

source: Arguments:
zh_cn: 参数：

source: Arithmetical (+, -, *, /)
zh_cn: 算术运算(+, -, *, /)

source: Array (1D, 16 elements)
zh_cn: 数组 (1D, 16 元素)

source: Array (handle)
zh_cn: 数组（句柄）

source: Array Functions
zh_cn: 数组函数

source: Arrays
zh_cn: 数组

source: Arrays are essential for making RPGs, because instead of having a jumble of variables, you just have a few lines, which you can refer back to at any time.
zh_cn: 制作RPG游戏时数组是基础的用法，仅需数行，替代使用混乱的变量，并且可以随时可以重新提及。

source: Arrays created in this way will have each entry initialised to 0 unless you specify an (optional) initialisation value.
zh_cn: 以这种方式创建的数组中每一元素的都会被初始化为0，除非你指定了初始值（可选）。

source: Arrays may seem confusing at first, but they can be extremely useful and are an essential part of making games.
zh_cn: 数组在一开始看来可能不容易理解，但是它们在游戏制作的过程中是非常有用的也是不可或缺的一部分。

source: Arrow Down
zh_cn: 方向键下

source: Arrow Keys
zh_cn: 箭头键

source: Arrow Left
zh_cn: 方向键左

source: Arrow Right
zh_cn: 方向键右

source: Arrow Up
zh_cn: 方向键上

source: As a small example, consider the following code which will move the instance towards the position x=200 in the room:
zh_cn: 作为一个小例子，想一想下面的代码，哪一块将移动实例朝着x=200移动：

source: As a very simple example, in the past multiplying by 32 might have taken several CPU cycles to execute, while a simple binary operation to do the same thing would have taken only 1.
zh_cn: 一个非常简单的例子，过去乘以 32 可能需要几个 CPU 周期来执行，而简单的二进制运算同样的事情只需要一次。

source: As above, only now the menu button is at the top.
zh_cn: 同上，只有菜单在顶部。

source: As above, only now the menu button is on the left.
zh_cn: 如上，只有菜单按钮在左边。

source: As an additional tool for debugging compiled games, there are certain command line parameters that can be used when you run the final game package on Window.
zh_cn: 作为调试编译游戏的附加工具，当您在Window上运行最终游戏包时，可以使用某些 命令行参数。

source: As an example, consider the following code.
zh_cn: 例如，考虑下面的代码。

source: As before, each number points to a position within the array, only this time each position has an "a" and "b" coordinate.
zh_cn: 之前每个数值对应数组的一个位置，但这次一个位置有“a” 和 “b”两个坐标。

source: As explained in the section on Configurations, you can store certain details for compiling your game as Configs.
zh_cn: 如 配置 部分所述，您可以将游戏编译的某些详细信息储存为 配置。

source: As explained in the section on Resources, a sprite is an image that can be animated (although it doesn't have to be) and then drawn to the screen.
zh_cn: 如 资源 部分所述，精灵是一个图像， 可以是动画（不一定必须是），然后绘制到屏幕上。

source: As indicated, wherever you use a parent object, this also applies to the descendants (or "children").
zh_cn: 如所示，无论何处使用父对象，这也适用于后代（或“子”）。

source: As long as the expression is true, the statement (which can also be a code block) is executed.
zh_cn: 只要表达式（expression）是true，这些语句（statement）（也可以是语句块）就会被反复执行。

source: As machines have gotten more complex, they have also reduced the time many complex instructions take to run so that now, a 32x32 bit multiply might well only take 1 cycle - same as the binary operator.
zh_cn: 因为机器已经变足够复杂了，这也减少了很多复杂指令的运行时间，一个 32 x 32 位乘法可能也只需要一个周期 - 同二进制运算一样的效率。

source: As mentioned above, all normal drawing in your game is done on the application surface, and this surface can be changed and manipulated just like a normal surface.
zh_cn: 正如上面提过的，所有普通绘制都是在应用表面层里进行的，这个表面可以像通常的表面层一样改变或控制。

source: As mentioned above, you can pass a number of arguments to a script, and it will use these to perform the task you have written it for.
zh_cn: 如前所述，你可以向一个脚本传递（Pass）一些参数，然后它就会用这些参数来执行你为它所编写的任务。

source: As such, a sprite is an image drawn using the GameMaker Studio 2 Image Editor, or made with any external drawing program and imported into GameMaker Studio 2.
zh_cn: 因此，精灵使用 GameMaker Studio 2 图像编辑器来绘制图像，或使用外部绘图程序制作并导入到 GameMaker Studio 2 中。

source: As the name implies, this window will show all instance variables, local variables and built in variables associated with the instance currently being stepped through in the Source window (if an instance is being referenced using the keyword "other" or the with statement, then this window will show that instances properties instead).
zh_cn: 顾名思义，这个窗口会显示所有实例变量，局部变量和与当前源代码窗口中按步跳过的实例的内置变量。（如果一个实例是用关键词“other”或者with语句引用来的，那么这个窗口中会显示该实例的属性）。

source: As values in all expressions you can use numbers, variables, or functions that return a value, and sub-expressions can be placed between brackets too.
zh_cn: 表达式的值可以使用数字、变量，或者有返回值的函数，子表达式放在括号里面。

source: As with iOS you will require an Apple Mac computer running OSX or higher as well as the relevant certificates and permissions.
zh_cn: 与 iOS 一样，您将需要运行 OSX 或更高版本的 Mac 电脑以及具备相关的证书和权限 。

source: As with the compiler errors, the syntax errors window will direct you to the object, the event and the specific lines that are giving the issue, and will often be shown with a brief explanation of what the error is.
zh_cn: 与编译器错误一样，语法错误窗口将引导您找到物体，事件和出现问题的特定行，并且通常也会简要说明错误是什么。

source: As with the other different resources, it is recommended that you name your sounds using an appropriate prefix like "snd_" so you can easily identify it later.
zh_cn: 与其他的资源一样，建议您使用合适的前缀（如“snd_”）来命名您的声音，以便以后可以轻松识别。

source: As you can probably see, the top left of the window has a field for the "Name" of the sprite.
zh_cn: 你可以看到，窗口的左上方有精灵的名字。

source: As you can see from the image below, the bar is made up of various colours, with each one signifying a different aspect of the games performance, where the larger the bar, the more time that aspect requires and the larger the performance hit from it:
zh_cn: 从下面的图像可以看出，显示条由各种颜色组成，每一种颜色都代表游戏性能的一方面，显示条越长，则该方面需要的时间越多，其性能就越强大：

source: As you can see in our example object there are a number of events listed that it should respond to, but initially when you create an object this list is empty and you must decide which events you need and what instances of that object should do when those events are triggered.
zh_cn: 正如你可以在我们的示例对象中看到的那样列出了许多应该响应的事件，但是最初当你创建一个对象时，这个列表是空的，你必须决定你需要哪些事件，那些对象应该做什么事件被触发。
